---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.OnlyUpwardFacesUsed
source: html/12fee65b-1d68-8c15-4a41-a83137a545e7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.OnlyUpwardFacesUsed Property

The selected faces contain both upward and downward pointing faces. Only the upward pointing faces were used.

## Syntax (C#)
```csharp
public static FailureDefinitionId OnlyUpwardFacesUsed { get; }
```